tap "farion1231/ccswitch"
tap "homebrew/services", "https://gitee.com/cunkai/homebrew-services.git"
tap "madlouse/360teams"
tap "madlouse/agent-cli-api"
tap "madlouse/agenticos"
tap "madlouse/ghostty"
tap "manaflow-ai/cmux"
tap "tw93/tap"
brew "bat"
brew "blueutil"
brew "btop"
brew "docker", link: false
brew "fastfetch"
brew "ffmpeg"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "glow"
brew "hyperfine"
brew "librsvg"
brew "maven"
brew "mdcat"
brew "mysql@8.4"
brew "node@20"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "ruby"
brew "smartdns"
brew "starship"
brew "tesseract"
brew "tesseract-lang"
brew "uv"
brew "wgcf"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "madlouse/agent-cli-api/agent-cli-api"
brew "madlouse/agenticos/agenticos"
brew "tw93/tap/mole"
cask "1password-cli"
cask "farion1231/ccswitch/cc-switch"
cask "claude-code"
cask "cmux"
cask "docker-desktop", args: { appdir: "/Applications" }
cask "font-cascadia-code"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "macdown"
cask "squirrel-app"
cask "zed"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-ssh"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "grapecity.gc-excelviewer"
vscode "hediet.vscode-drawio"
vscode "highagency.pencildev"
vscode "mhutchie.git-graph"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "openai.chatgpt"
vscode "redhat.java"
vscode "tomoki1207.pdf"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-lombok"
vscode "vscjava.vscode-maven"
vscode "vstirbu.vscode-mermaid-preview"
uv "arxiv-mcp-server"
